app/controllers/studies_controller.rb

  def index
    @studies = Study.all
---
SELECT "studies".* FROM "studies"

  def create
    @study = Study.new(study_params)


      if @study.save
---
INSERT INTO "studies" ("title", "started", "completed", "created_at", "updated_at") VALUES ('New Study', 0, 0, '2024-12-27 18:06:18.664441', '2024-12-27 18:06:18.664441') RETURNING "id"

 def update
  if @study.update(study_params)
---
UPDATE "studies" SET "title" = 'edited', "started" = 0, "updated_at" = '2024-12-27 18:08:42.536891' WHERE "studies"."id" = 9

def destroy
  @study.destroy
---
DELETE FROM "studies" WHERE "studies"."id" = 13

def set_study
  @study = Study.find(params[:id])
---
SELECT "studies".* FROM "studies" WHERE "studies"."id" = 13 LIMIT 1